{
  "Hyatt Regency Tamaya Resort & Spa": {
    "description": "Enjoy stunning Southwestern beauty and world-class amenities at the incredible Hyatt Regency Tamaya Resort & Spa. The resort features two sparkling pools: the quiet adult Kiva Pool & the kid-friendly Plaza Pool for fun for the whole family. Soak up the sun, splash in the pools! A \"daycation\" at the Hyatt Regency Tamaya is the perfect place to create new memories with friends and family!",
    "passes": "Day Pass includes:\n                \nThe Kiva Pool\nThe Plaza Pool with waterslide\nLimited food service\nTowel service\nTennis and basketball courts, balls and rackets provided\nComplimentary wifi\nComplimentary self-parking\n\n\nChildren under 16 yrs must be accompanied by an adult.",
    "hours": "Hours\n              \nPool \n\n\nCLOSED FOR THE SEASON\n\nWaterslide \n\n\nCLOSED FOR THE SEASON",
    "address": "1300 Tuyuna TrailBernalillo",
    "city": "NM 87004",
    "state": "NM",
    "icons": [
      "Pool",
      "Food Service",
      "Drink Service",
      "Cabana"
    ]
  },
  "Snowpine Lodge": {
    "description": "Nestled among Utah’s Wasatch mountains is the newly rebuilt Snowpine Lodge, Alta’s premier year-round luxury hotel. Enjoy breathtaking views while relaxing in the heated outdoor pool and two outdoor hot tubs. Experience the indoor grotto, saunas, and steam rooms and leave feeling refreshed and rejuvenated after a long day of outdoor adventures. Peak relaxation begins and ends with the Stillwell Spa.",
    "passes": "Day Pass includes:\n                \nOutdoor heated pool (temporarily closed)\nOutdoor whirlpools (temporarily closed)\nFood and drink service from Swen's Restaurant and The Gulch Pub\nPool games including volleyball and basketball\nFitness center\nMen's and women's lockers and showers\nSauna\nSteam room\nRelaxation lounge\nComplimentary wifi\nComplimentary self-parking\n\n\nA 20% service fee will be charged at the hotel.\n\nAdults only.  Must be 18+.\n\n              \n                Summer Glow Head to Toe 75-Minute Treatment includes:\n                Pair any 50-minute treatment with a 25-minute treatment.\n\n\nSpa Day Pass (all amenities included in the Day Pass)\n50-minute massage\n25-minute treatment of choice: scalp massage, foot treatment, or collagen face mask\n\n\nPool and whirlpool are temporarily closed.\n\nA 20% service fee will be charged at the hotel.\n\nMust be 18+. Please select treatments at checkout.",
    "hours": "Hours\n              \nPool \n\n\n10:00am - 6:00pm (varies depending on weather, special events, etc.)\n\nSpa\n\n\n10:00am - 6:00pm",
    "address": "10420 Little Cottonwood Rd",
    "city": "Alta",
    "state": "UT",
    "icons": [
      "Hot Tub",
      "Fitness Center",
      "Pool",
      "Spa",
      "Food Service",
      "Drink Service"
    ]
  },
  "Waldorf Astoria Park City": {
    "description": "Escape to the luxurious Waldorf Astoria Hotel in Park City Utah, offering an unparalleled experience at one of the top ski destination in the US. Open year-round, the heated alpine pool and multiple hot tubs allow guests to enjoy the water in any weather. Sip your favorite handcrafted cocktail poolside in a luxurious cabana and enjoy personal VIP service and a complimentary fruit plate. The Waldorf Astoria in Park City is the perfect alpine retreat.",
    "passes": "Cabana includes:\n                \nPremium comfort shaded cabana for up to 10 people\nHeated alpine pool\nWhirlpool\nPoolside food and drink service\nMen's and women's showers and changing rooms\nComplimentary bottled water\nComplimentary fresh fruit bowl\nComplimentary wifi\nComplimentary valet parking",
    "hours": "Hours\n              \nPool and Cabana\n\n\n11:00am - 6:00pm\n\nPoolside Drink Service\n\n\n11:00am - 6:00pm",
    "address": "2100 Frostwood Dr",
    "city": "Park City",
    "state": "UT",
    "icons": [
      "Cabana",
      "Hot Tub",
      "Pool",
      "Food Service",
      "Drink Service"
    ]
  },
  "YotelPAD Park City": {
    "description": "Innovative spaces, brilliant design, and premium amenities are the hallmarks of the YotelPAD experience.  Located in the heart of Canyons Village, YOTEL is reinventing the way people work, play, gather, and socialize.  The hotel provides all the modern essentials to stay connected and work, plus luxury resort amenities such as the fitness center, pool, hot tub, steam room, game rooms, and more.",
    "passes": "Work Pass includes:\n                \nPrivate guestroom from 8am - 7pm with work desk and chair, Smart TV and full bath \nOutdoor heated pool (reservation required)\n24-hour Grab+Go market \nKomyunity social space with pool table and Pac-Man machine \nComplimentary wifi\nComplimentary valet parking\n\n\n              \n                HUB Boardroom includes:\n                \nPrivate board room from 8am to 5pm with seating for up to 16 people\n64-inch TV with HDMI \nNote pads and pens\nComplimentary bottled water \nComplimentary wifi\nComplimentary valet parking\n\n\nCatering options available",
    "hours": "Hours\n              \nWork Pass \n\n\n8:00am - 7:00pm",
    "address": "2670 W Canyons Resort Drive",
    "city": "Park City",
    "state": "UT",
    "icons": [
      "Food Service",
      "Drink Service",
      "Fitness Center"
    ]
  },
  "Four Points by Sheraton Salt Lake City Airport": {
    "description": "Conveniently located close to Salt Lake City International Airport, the Four Points Salt Lake City Airport Hotel features modern style rooms and premium amenities for a day getaway to work and play. Enjoy office essentials with the luxuries of a hotel such as a fitness center, outdoor pool and an on-site restaurant.",
    "passes": "Day Pass includes:\n                \nHeated outdoor pool\nHot tub\nHigh-speed wifi \nOn-site restaurant The Glowbal Bite open for dinner from 5pm - 10pm\nPantry market available 24/7 for snacks and beverages\nFitness center\nComplimentary self-parking\n\n\nCredit card required upon check-in for incidentals.\n\n              \n                Work Pass includes:\n                \nPrivate guestroom from 9am - 5pm with work desk and chair, mini-fridge, flatscreen TV and private bathroom\nHigh-speed wifi \nOn-site restaurant The Glowbal Bite open for dinner from 5pm - 10pm\nPantry market available 24/7 for snacks and beverages\nFitness center\nComplimentary self-parking\n\n\nCredit card required upon check-in for incidentals.\n\n              \n                Meeting Room includes:\n                \nPrivate boardroom from 9am - 5pm for up to 10 people with boardroom table and chairs and AV equipment\nHigh-speed wifi \nOn-site restaurant The Glowbal Bite open for dinner from 5pm - 10pm\nPantry market available 24/7 for snacks and beverages\nFitness center\nComplimentary self-parking\n\n\nCredit card required upon check-in for incidentals.",
    "hours": "Hours\n              \nPool \n\n\nCLOSED FOR THE SEASON\n\nWork Pass \n\n\n9:00am - 5:00pm\n\nMeeting Room \n\n\n9:00am - 5:00pm",
    "address": "200 N Admiral Byrd Road",
    "city": "Salt Lake City",
    "state": "UT",
    "icons": [
      "Pool",
      "Hot Tub",
      "Food Service",
      "Drink Service",
      "Fitness Center"
    ]
  },
  "Courtyard by Marriott Amelia Island": {
    "description": "Spend the day at Courtyard by Marriott Amelia Island, a newly-built hotel located at the northern tip of picturesque Amelia Island, known for its natural Appalachian quartz beaches and sand dunes. Relax and unwind on the pool deck, take a refreshing dip in the outdoor pool, soak in the hot tub, or break a sweat in the well-equipped fitness center including Peloton bikes. Enjoy delicious bites, creatively crafted cocktails, draft beer, and mixed drinks poolside from Tides Pool Bar and Grill. The hotel also has over 6,000 sq. ft. of meeting & event spaces with an events team that is ready to ensure your next gathering is a success. The Courtyard by Marriott Amelia Island is the perfect place for work and play.",
    "passes": "Day Pass includes:\n                \nOutdoor heated pool\nHot tub\nPoolside food & beverage service from Tides Bar and Grill\nFood and drinks available from Bistro & Starbucks\nBeach access (chairs and umbrellas available to rent)\nFitness center\nComplimentary wifi\nComplimentary self-parking\n\n\n              \n                Keystone Boardroom includes:\n                \nDay Passes for up to 10 people (all amenities included in the Day Pass)\nPrivate meeting room for up to 10 people from 8am-10pm\nFlat-screen TV\nFood and beverage service available upon request for an extra fee\n\n\nA service charge of 24% will be added to food and beverage purchases.\n\n              \n                Harbor Meeting Room includes:\n                \nDay Passes for up to 4 people (all amenities included in the Day Pass)\nPrivate meeting room for up to 50 people from 8am-10pm\nFlat-screen TV\nFood and beverage service available upon request for an extra fee\n\n\nA service charge of 24% will be added to food and beverage purchases.\n\n              \n                Lighthouse Meeting Room includes:\n                \nDay Passes for up to 4 people (all amenities included in the Day Pass)\nPrivate meeting room for up to 200 people from 8am-10pm\nFlat-screen TV\nFood and beverage service available upon request for an extra fee\n\n\nA service charge of 24% will be added to food and beverage purchases.",
    "hours": "",
    "address": "2700-1 Atlantic Ave.",
    "city": "Amelia Island",
    "state": "FL",
    "icons": [
      "Drink Service",
      "Food Service",
      "Pool",
      "Hot Tub",
      "Beach Access",
      "Fitness Center"
    ]
  },
  "SpringHill Suites by Marriott Amelia Island": {
    "description": "A relaxing daycation awaits at SpringHill Suites Amelia Island, a newly-built hotel blending design, functionality, and modern amenities such as an outdoor pool with fountains and fitness center featuring Peloton bikes. The sister property, Courtyard by Marriott Amelia Island, connected to the hotel via front entrance and lobby, houses a full-service restaurant, the Bistro, and a convenient poolside bar, Tides Pool Bar and Grill, all of which promise exquisite Southern coastal culinary delights from the talented executive chef.",
    "passes": "Day Pass includes:\n                \nOutdoor heated pool\nHot tub\nPoolside food & beverage service from Tides Bar and Grill\nFood and drinks available from Bistro & Starbucks\nBeach access (chairs and umbrellas available to rent)\nFitness center\nComplimentary wifi\nComplimentary self-parking",
    "hours": "",
    "address": "2700-2 Atlantic Ave.",
    "city": "Amelia Island",
    "state": "FL",
    "icons": [
      "Drink Service",
      "Food Service",
      "Pool",
      "Hot Tub",
      "Beach Access",
      "Fitness Center"
    ]
  },
  "The Ritz-Carlton, Amelia Island": {
    "description": "Located on 13 miles of pristine beaches, The Ritz-Carlton, Amelia Island blends southern charm, magnificent scenery, and luxury amenities for an unforgettable getaway. Spend the day enjoying both indoor and outdoor heated pools, hot tubs, daily activities and adventures. Savor a selection of fresh Florida fare and signature cocktails at one of the resort's four restaurants. For the full experience of tranquility and relaxation, book a Spa Pass and relish in blissful amenities at The Ritz-Carlton Spa®. A day by the sea at the Ritz- Carlton is the perfect escape in an island paradise!",
    "passes": "Day Pass includes:\n                \nOutdoor heated pool\nChildren's pool\nIndoor heated pool\nTwo hot tubs\nFood and drink available from the Ocean Bar & Grill\nFitness center\nKids activities, tennis, golf, and tours available at resort\nComplimentary valet parking\nComplimentary wifi\n\n\n              \n                Spa Pass includes:\n                \nMen's and women's lockers and showers\nOutdoor spa lap pool\nTherapeutic whirlpool with a cascading waterfall\nEucalyptus infused steam room\nSauna\nRelaxation lounge\nFood and drink available from the Ocean Bar & Grill\n15% discount on spa services (booked day-of, subject to availability) \nComplimentary wifi \nComplimentary valet parking \n\n\nSpa Pass does not include access to the main pool. Please enjoy the spa pool with the Spa Pass. For full access, please book a Day Pass with your Spa Pass.\n\nSpa Passes are for adults 21+. No kids allowed.\n\n              \n                Cabana includes:\n                \nDay Passes for up to 4 people (all amenities included in the Day Pass)\nAssigned cabana butler\nKeepsake Ritz-Carlton Day bag filled with pool essentials\nOverhead ceiling fan\nSunscreen, tanning, and aloe protection\n32” LCD TV with remote\nMini fridge filled with soft drinks & bottled water\nAn assortment of snacks - Nature Valley Bars (2 of each - chocolate chip, oatmeal, original, & peanut butter), Chips (2 of each- Miss Vickie’s kettle cooked chips, Rold Gold pretzels, Tropical trail mix of dried fruits & nuts)\nCompliments from the kitchen and the bar including a refreshing fruit plate, guest choice of appetizer as well as guest choice of top specialty coastal cocktail (one per person over 21).  A non-alcoholic package is also available in place of the cocktails.",
    "hours": "Hours\n              \nPool \n\n\n8:00am - 6:00pm\n\nCabana \n\n\n10:00am - 6:00pm\n\nSpa\n\n\n8:30am - 7:00pm",
    "address": "4750 Amelia Island Pkwy Fernandina Beach",
    "city": "FL 32034",
    "state": "FL",
    "icons": [
      "Fitness Center",
      "Drink Service",
      "Food Service",
      "Spa",
      "Cabana",
      "Pool",
      "Hot Tub"
    ]
  },
  "Four Points by Sheraton Anaheim": {
    "description": "Soak up some magic and sunshine at the Four Points by Sheraton Anaheim in Disneyland® country; the perfect daycation spot for your family and friends. Relax by the pool in a comfy lounge chair or in the hot tub, and sip tasty tropical cocktails while being surrounded by palm trees. When the sun sets, enjoy the great views of Disney's nightly fireworks show.",
    "passes": "Day Pass includes:\n                \nOutdoor heated pool\nHot tub\nPoolside food & drink service from Tru Grits (6:30-10:30pm)\nComplimentary wifi\nDiscounted self-parking for $3 an hour",
    "hours": "Hours\n              \nPool \n\n\n8:00am - 10:00pm\n\nPoolside Food & Drink Service from Tru Grits\n\n\n6:30pm - 10:30pm",
    "address": "1221 S Harbor Blvd",
    "city": "Anaheim",
    "state": "CA",
    "icons": [
      "Pool",
      "Hot Tub",
      "Food Service",
      "Drink Service"
    ]
  },
  "JW Marriott, Anaheim Resort": {
    "description": "Level up your leisure and enjoy luxury comforts and enriching experiences at the JW Marriott, Anaheim Resort, Orange County’s newest luxury hotel addition. Infused with modern art, the hotel offers an inspiring outdoor oasis with a rejuvenating heated pool, and the Citriculture bar serving elevated cocktails and locally inspired bites. Private Daybeds and Cabanas line the pool deck offering shade, plush sofa seating, and a ceiling fan for a premium relaxation experience. Get lost in augmented reality with the first-of-its-kind JW Butterfly Garden where a mindful stroll will connect you to nature and uplift your body, mind and spirit. Take the elevator to the top and explore Parkestry Rooftop Bar, Anaheim’s highest bar and lounge with stunning Southern California sunsets. A day at the JW Marriott is the luxurious vacation day you deserve.",
    "passes": "Daybed includes:\n                \nPrivate shaded daybed for up to 4 people\nOutdoor heated pool\nPoolside food & drink service from Citriculture\nComplimentary bottled water and sunscreen\nComplimentary wifi\nDiscounted valet parking for $15\n\n\nAdults 21+ only\n\n              \n                Cabana includes:\n                \nPrivate shaded cabana with plush sofa seating and a ceiling fan for up to 4 people\nOutdoor heated pool\nPoolside food & drink service from Citriculture\nComplimentary bottled water and sunscreen\nComplimentary wifi\nDiscounted valet parking for $15\n\n\nAdults 21+ only",
    "hours": "Hours\n              \nPool \n\n\n6:00am - 10:00pm\n\nFood & Drink Service \n\n\nVaries by day",
    "address": "1775 S Clementine St.",
    "city": "Anaheim 92802",
    "state": "Anaheim",
    "icons": [
      "Pool",
      "Food Service",
      "Drink Service",
      "Cabana"
    ]
  },
  "Cambria Hotel Anaheim Resort Area": {
    "description": "Fun for friends and family awaits at the upscale Cambria Hotel Anaheim Resort Area, just minutes from Disneyland, featuring two outdoor pools, a 30,000-square-foot water park plus a putting green and an outdoor movie wall. Kids can play to their heart's content at the waterslides, splash pad, or basketball court while parents relax in the hot tub or soak up the California sunshine by the pool. The grab-and-go market offers tasty snacks, bites, and beverages, and adults can sip delicious drinks from the poolside Cambria Bar. Several eateries such as Starbucks, The Habit, Yogurtland, California Fish Grill, and Jersey Mike's Subs are also located adjacent to the property, a mere short walk away. End the day sitting around the firepit table, while taking in the sunset.",
    "passes": "Day Pass includes:\n                \nOutdoor heated pool\nKids pool\n30,000 sq.ft water park with water slides, pop-up jets, and splash pads\nHot tub\nTowel service \nFood and drinks available from Cambria Bar and Bites (hours vary) & Lobby Market (24 hours)\nEateries adjacent to property: Starbucks, The Habit, Yogurtland, California Fish Grill, Ono Hawaiian BBQ, and Jersey Mike's Subs\nFitness center\nBasketball court\nPutting green\nComplimentary wifi\nValet parking available for $15\n\n\nNo lifeguard on duty. No outside food and beverage allowed. Height requirements for the waterslides are 44 Inches.",
    "hours": "Hours\n              \nPool\n\n\n8:00am - 5:00pm\n\nCambria Bar and Bites\n\n\nHours vary by season \n\nLobby Market\n\n\n24 Hours",
    "address": "101 E Katella Ave",
    "city": "Anaheim CA 92802",
    "state": "Anaheim",
    "icons": [
      "Hot Tub",
      "Fitness Center",
      "Drink Service",
      "Food Service",
      "Pool"
    ]
  },
  "Sheraton Park Hotel at the Anaheim Resort": {
    "description": "Ideally located steps from Disneyland, the Sheraton Park Hotel at the Anaheim Resort is the perfect place to unwind with a cold one. Whether you need a day to do nothing or a day of fun with the whole family, relaxing is easy by the heated outdoor pool and hot tub. When it’s time for some libations, order yourself poolside food and drink service from SPLASH Pool Bar. Catching rays never felt so good.",
    "passes": "Day Pass includes:\n                \nHeated outdoor pool\nHot tub\nPoolside towels and drink service from SPLASH Pool Bar\nSnack service available from Lobby Cafasia\nComplimentary wifi\nDiscounted self-parking for $10",
    "hours": "Hours\n              \nPool \n\n\n7:00am - 10:00pm\n\nFood & Drink Service \n\n\n11:00am - 7:00pm (may vary due to weather)",
    "address": "1855 S Harbor Blvd",
    "city": "Anaheim",
    "state": "CA",
    "icons": [
      "Hot Tub",
      "Pool",
      "Food Service",
      "Drink Service"
    ]
  },
  "Radisson Blu Anaheim": {
    "description": "Located in the Anaheim Resort area, the Radisson Blu Anaheim AAA Four Diamond hotel is the perfect place for your next daycation. The outdoor heated pool features a hot tub and a splash pad so the kids can have fun while the adults sit back and relax and enjoy lunch and drinks from Oasis Pool Bar. For a more private luxury experience, book a cabana for you and your crew. Escape for the day to the Radisson Blu Anaheim!",
    "passes": "Day Pass includes:\n                \nOutdoor heated pool with splash pad\nHot tub\nFood and drinks available for purchase\nFire pit\nTowel service\nComplimentary wifi\nDiscounted self-parking for $10\n\n\nNo outside food and drinks allowed. Wristbands must be worn in the pool area.\n\n              \n                Standard Cabana includes:\n                \nDay Passes for up to 4 people (all amenities included in Day Pass)\nPremium shaded cabana with one daybed\nFridge\nSafe for valuables\nBottled water\nDiscounted self-parking for $10\n\n\nNo outside food and drinks allowed. Wristbands must be worn in the pool area.\n\n              \n                Deluxe Cabana includes:\n                \nDay Passes for up to 4 people (all amenities included in Day Pass)\nPremium shaded cabana with one daybed and 2 chairs\nFridge\nSafe for valuables\nBottled water\nDiscounted self-parking for $10\n\n\nNo outside food and drinks allowed. Wristbands must be worn in the pool area.\n\n              \n                Premium Cabana includes:\n                \nDay Passes for up to 6 people (all amenities included in Day Pass)\nPremium shaded cabana with 2 chairs, one daybed and 2 lounge chairs\nFridge\nSafe for valuables\nBottled water\nDiscounted self-parking for $10\n\n\nNo outside food and drinks allowed. Wristbands must be worn in the pool area.\n\n              \n                Premium Plus Cabana includes:\n                \nDay Passes for up to 8 people (all amenities included in Day Pass)\nPremium shaded cabana with 2 chairs, one daybed and 2 lounge chairs\nFridge\nSafe for valuables\nBottled water\nDiscounted self-parking for $10\n\n\nNo outside food and drinks allowed. Wristbands must be worn in the pool area.\n\n              \n                Work Pass includes:\n                \nDay Pass for 1 person (all amenities included in the Day Pass)\nPrivate guest room for 1 person from 9am - 6pm with work desk and chair, highspeed wifi, Nespresso coffeemaker, flatscreen tv, refrigerator and full bath\nDiscounted self-parking for $10\n\n\nWork Pass is for 1 person. For a Day Room for up to 4 people, please purchase the Day Room product.\n\n              \n                Day Room includes:\n                \nDay Passes for up to 4 people (all amenities included in the Day Pass)\nPrivate guest room from 9am - 6pm \nDiscounted self-parking for $10",
    "hours": "Hours\n              \nPool \n\n\n9:00am - 10:00pm\n\nCabanas \n\n\n9:00am - 10:00pm\n\nOasis Pool Bar\n\n\nFriday - Sunday 11:30pm - 4:00pm \nMonday - Thursday Closed \n\nFirelake Restaurant - Sit Down Service\n\n\nBreakfast (Wednesday - Sunday) 7:00am - 10:30am \nDinner (Wednesday - Sunday) 5:00pm - 9:00pm \n\nBlue Market Place - Grab & Go Breakfast and Lunch\n\n\nDaily 6:30am - 2:00pm",
    "address": "1601 S Anaheim Blvd",
    "city": "Anaheim CA 92805",
    "state": "Anaheim",
    "icons": [
      "Cabana",
      "Pool",
      "Hot Tub",
      "Food Service",
      "Drink Service"
    ]
  },
  "Delta by Marriott Anaheim": {
    "description": "Splash and relax at the idyllic Orange County oasis, the Delta by Marriott Anaheim. The hotel features a large outdoor heated pool and a jacuzzi for the perfect pool day. The Delta offers the convenient location in Anaheim to cool off from the SoCal sunshine and enjoy resort-style amenities.",
    "passes": "Day Pass includes:\n                \nHeated pool\nJacuzzi\nMarket with snacks and drinks for purchase at the front desk\nFitness center\nComplimentary wifi\nComplimentary parking",
    "hours": "Hours\n              \nPool \n\n\n9:00am - 9:00pm",
    "address": "12021 Harbor BlvdGarden Grove",
    "city": "CA 92840",
    "state": "CA",
    "icons": [
      "Fitness Center",
      "Hot Tub",
      "Drink Service",
      "Food Service",
      "Pool"
    ]
  },
  "Hyatt Regency Orange County": {
    "description": "Fun in the sun never stops at Hyatt Regency Orange County, where family-friendly amenities are available at every turn. Located just minutes away from Disneyland, this centrally located resort is ideal for guests who want big thrills, without waiting in line. Unwind by the Hyatt Regency Orange County’s two outdoor pools while you order poolside food and beverage service. If you’re feeling competitive, hit the basketball and pickleball courts. Round out the day with a game of oversized checkers, ping-pong, bocce ball, shuffleboard or cornhole. This is how you vacation.",
    "passes": "Day Pass includes:\n                \nNorth Tower Pool\nSouth Tower Pool\nHot tub\nPoolside food and beverage service at South Tower Pool (seasonally Fri-Sun) \nFire pit\nFitness center\nBasketball and pickleball court\nSports deck with games including oversized checkers, ping-pong, bocce ball, shuffleboard, Connect4 and corn-hole\nDiscounted self-parking for $10\nComplimentary wifi",
    "hours": "Hours\n              \nPool \n\n\n6:00am - 10:00pm\n\nFire Pit \n\n\n5:00pm - 10:00pm\n\nFood & Drink Service\n\n\nFri - Sun 11:00am - 11:00pm (hours may vary by season)",
    "address": "11999 Harbor Blvd",
    "city": "Garden Grove",
    "state": "CA",
    "icons": [
      "Hot Tub",
      "Fitness Center",
      "Pool",
      "Food Service",
      "Drink Service"
    ]
  },
  "Avenue of the Arts Costa Mesa, A Tribute Portfolio Hotel": {
    "description": "Avenue of the Arts Costa Mesa, A Tribute Portfolio Hotel breaks beyond the typical hotel experience with an eclectic arts-inspired design and inventive culinary creations. The focal point is the heated outdoor pool and hot tub, perfect for a relaxing day lounging in the Southern California sunshine. Spacious rooms with balconies and modern amenities provide a quiet and inspiring environment to focus. The property features vibrant spaces, comfortable features, and luxurious amenities for the perfect day to work, meet, relax and play.",
    "passes": "Work Pass includes:\n                \nPrivate guest room from 8am to 5pm with work desk and chair, private balcony, flat-screen TV, coffeemaker and full bath \nHeated outdoor pool\nHot tub\nTo-go food and beverage from Silver Trumpet restaurant \nComplimentary bottled water \nComplimentary wifi \nSelf-parking for $14",
    "hours": "Hours\n              \nWork Pass\n\n\n8:00am - 5:00pm\n\n\n \n\nTo-go Food and Beverage \n\n\n8:00am - 5:00pm\n\n\n \n\nPool \n\n\n8:00am - 5:00pm\n\n-",
    "address": "3500 Avenue of the Arts",
    "city": "Costa Mesa",
    "state": "CA",
    "icons": [
      "Pool",
      "Hot Tub",
      "Food Service",
      "Drink Service"
    ]
  },
  "Pasea Hotel & Spa": {
    "description": "The 4.5 star luxury oceanfront Paséa Hotel & Spa in Huntington Beach is a modern oasis with an unrivaled sense of clean, coastal style and comfort for the discerning guest. Located just a block from the sandy beach, the Ninth Island Pool area of the resort offers an oceanfront pool, lounge pool, and hot tub as well as a pool bar. Lounge poolside in a comfortable chaise lounge chair, daybed, or full-service cabana stocked with extra delights. Enjoy delicious fare and drinks served poolside while gazing out at the expansive ocean. Immerse yourself in coastal style and elegance with a day at the incredible Paséa Hotel & Spa!",
    "passes": "Day Pass includes:\n                \nOutdoor pool\nJacuzzi\nFood and drink service\nTowel service\nOutdoor showers\nDiscounted valet parking ($10 daily rate)\nComplimentary wifi\n\n\n              \n                Daybed includes:\n                \nDay passes for 2 adults (all amenities included in the Day Pass)\nPremium comfort daybed seating\nComplimentary valet parking for one car, additional vehicles at a discounted rate of $10\n\n\nDaybeds are reserved for adults 18+ only. Children not allowed. \nAdditional guests will need to purchase Day Passes. \nDaybeds must be canceled at least 7 days prior to your visit date.\n\n              \n                Cabana includes:\n                \nDay Passes for up to 6 people (all amenities included in the Day Pass)\nPremium comfort sofa seating and two chaise lounge chairs\nFlat screen TV\nFridge with water and assorted soft drinks\nCeiling fan\nComplimentary valet parking for two cars, additional vehicles at a discounted rate of $10 \n\n\nChildren under 3 do not count towards max capacity. \nCabanas must be canceled at least 7 days prior to your visit date.",
    "hours": "Hours\n              \nPool \n\n\n8:00am - 10:00pm\n\nCabana \n\n\n8:00am - 10:00pm\n\nFood and Drink Service \n\n\n11:00am - sunset",
    "address": "21080 Pacific Coast Hwy Huntington Beach",
    "city": "CA 92648",
    "state": "CA",
    "icons": [
      "Hot Tub",
      "Pool",
      "Food Service",
      "Drink Service",
      "Spa",
      "Cabana"
    ]
  },
  "Hyatt Regency Huntington Beach Resort & Spa": {
    "description": "Relax and play at Orange County's beach front resort oasis, Hyatt Regency Huntington Beach Resort & Spa. Featuring lush tropical grounds and ocean views, the resort offers multiple pools, beach access, two full service restaurants, poolside dining, grab ‘n go market and pizzeria, and activities for the whole family. Lounge by the lagoon-style pool, Mankota’s, while enjoying a delicious lunch, smoothies, tropical cocktails or local craft beer. Kids can zip down three waterslides and splash in the pools at the Slyder's Water Playground. Embrace the full resort experience with a daycation at the Hyatt Regency Huntington Beach!",
    "passes": "Day Pass includes:\n                24-hour advanced booking required\n\nDoes not include access to the spa.  For spa access, book a Spa Pass in addition to the Day Pass.\n\n\nMankota’s main lagoon-style pool, Slyder's pool and Spa Grotto\nJacuzzis\nBeach access\nFood and beverage service available daily (see hours below)\nKids activities and bike rentals available at resort\nComplimentary wifi\nDiscounted valet parking ($10)\n\n\nChildren must be at least 48 inches tall and only one person is permitted to use the slide at a time.\n\n              \n                Spa Pass includes:\n                20,000 square-foot Pacific Waters Spa\n\nDoes not include access to the pools.  For pool access, book a Day Pass or Cabana in addition to the Spa Pass.\n\n\nWhirlpools\nSauna\nSteam room\nWaterfall showers\nMens & women's locker rooms (includes personal locker)\nOutdoor relaxation areas\nFitness center \n4 hour validated parking\n\n\nGuests must be 18 years or older.\n\n              \n                Slyder's Cabana includes:\n                24-hour advanced booking required \n\nLocated at the water playground.  \n\n\nDay Passes for up to 6 people\nShaded cabana with sofa seating for 4 & 2 chaise lounge chairs outside of the cabana\nFlat screen TV\nCeiling fan\n\n\nA $20 service fee will be collected at check-in for all cabana rentals. An 18% service fee will be added to all food and beverage charges. \n Discounted valet parking for $10. Valid for up to 2 cars per cabana, additional cars will receive the discounted rate of $22. \n Children under 3 do not count towards max capacity.\n\n              \n                Mankota's Cabana includes:\n                24-hour advanced booking required \n\nLocated at the main pool.\n\n\nDay Passes for up to 6 people\nShaded cabana with sofa seating & 2 chaise lounge chairs outside of the cabana\nFlat screen TV\nCeiling fan\nFruit plate\nBottled waters\n\n\nA $20 service fee will be collected at check-in for all cabana rentals. An 18% service fee will be added to all food and beverage charges. \n Discounted valet parking for $10. Valid for up to 2 cars per cabana, additional cars will receive the discounted rate of $22. \n Children under 3 do not count towards max capacity.\n\n              \n                Mermaid Magic Experience - 10am includes:\n                Learn to swim like a mermaid! Experience includes tail rental, mermaid meet & greet photo op and mermaid swim instruction. Available Monday - Friday. An accompanying Adult Pass is required with each booking. Adult Pass includes all amenities in the Day Pass.\n\n\nTail rental\nMermaid meet & greet photo op\n30 minutes of mermaid swim instruction\n\n\n              \n                Mermaid Magic Experience - 11am includes:\n                Learn to swim like a mermaid! Experience includes tail rental, mermaid meet & greet photo op and mermaid swim instruction. Available Monday - Friday. An accompanying Adult Pass is required with each booking. Adult Pass includes all amenities in the Day Pass.\n\n\nTail rental\nMermaid meet & greet photo op\n30 minutes of mermaid swim instruction\n\n\n              \n                Mermaid Magic Experience - 12pm includes:\n                Learn to swim like a mermaid! Experience includes tail rental, mermaid meet & greet photo op and mermaid swim instruction. Available Monday - Friday. An accompanying Adult Pass is required with each booking. Adult Pass includes all amenities in the Day Pass.\n\n\nTail rental\nMermaid meet & greet photo op\n30 minutes of mermaid swim instruction",
    "hours": "Hours\n              \nPool \n\n\n10:00am - 10:00pm\n\nCabanas\n\n\nSummer 10:00am - 7:00pm \nSpring/Fall 10:00am - 6:00pm \nWinter 10:00am - 5:00pm \n\nFood & Drink Service \n\n\n11:30am - 5:00pm\n\nPacific Water Spa\n\n\n9:00am - 6:00pm\n\nWaterslide \n\n\nThe hours for the waterslide are subject to change. To confirm waterslide hours, please contact the hotel directly here.",
    "address": "21500 Pacific Coast Hwy",
    "city": "Huntington Beach",
    "state": "CA",
    "icons": [
      "Drink Service",
      "Food Service",
      "Spa",
      "Cabana",
      "Pool",
      "Hot Tub",
      "Beach Access"
    ]
  },
  "The Waterfront Beach Resort, a Hilton Hotel": {
    "description": "Located on the beautiful sands of Huntington Beach, The Waterfront Beach Resort is a relaxing seaside oasis. With a sparkling swimming pool, bonfires and access to the white sandy beach, The Waterfront Beach Resort is the perfect escape. For the ultimate luxurious retreat, book a Spa Pass and enjoy soothing amenities including a sauna, steam room and beautiful outdoor garden lounge. Whether you prefer to splash in the pool or roast marshmallows by the fire, the Waterfront Resort features ideal amenities for a picturesque daycation!",
    "passes": "Day Pass includes:\n                \nDriftwood Beach Club Pool with waterslide\nHuntington Pool\nHot tub\nBeach access with complimentary beach chair\nPoolside food and drink service from Riptide\nFitness center\nBike rentals and water sport rentals available (fees apply)\nComplimentary wifi\nValet parking is available for $20 per vehicle\n\n\nWristbands must be worn on the pool deck.\n\n              \n                Daybed includes:\n                Located at the Huntington pool without the waterslides.\n\n\nDay Passes for up to 2 people (all amenities included in Day Pass)\nPremium comfort daybed with optional shade\n\n\nAn 18% service fee will be charged for the total price of the daybed and on any food & beverage purchased. Wristbands must be worn on the pool deck.\n\n              \n                Spa Pass includes:\n                \nDay Pass (all amenities included in the Day Pass)\nOne 50-minute Drift Classic Massage; or One 50-minute Surf City Custom Facial\nIndoor jacuzzi\nSauna\nSteam room\nMen's and women's lockers and showers\nRelaxation lounge\nOutdoor garden lounge area\n\n\nSpa Treatments are for adults 18+ only. 24-hour advance booking required. An additional 20% service fee will be applied at the spa.\n\n              \n                50-Minute Spa Treatment includes:\n                \nOne 50-minute Drift Classic Massage; or One 50-minute Surf City Custom Facial\nIndoor jacuzzi\nSauna\nSteam room\nMen's and women's lockers and showers\nOutdoor garden lounge area\nRelaxation lounge\n\n\nSpa Treatments are for adults 18+ only. 24-hour advance booking required. Spa Treatment does not include pool access. For pool access, book the Spa Pass product. An additional 20% service fee will be applied at the spa.\n\n              \n                Driftwood Cabana includes:\n                Located at the Driftwood Beach Club Pool with a waterslide.\n\n\nDay Pass for up to 6 people (all amenities included in Day Pass) \nShaded cabana with sofa seating, lounge chairs and a HDTV\nMini fridge stocked with bottled water\n\n\nAn 18% service fee will be charged for the total price of the cabana and on any food & beverage purchased. Wristbands must be worn on the pool deck.\n\n              \n                Oceanfront Cabana includes:\n                Located at the Driftwood Beach Club Pool with a waterslide.\n\n\nDay Passes for up to 6 people (all amenities included in Day Pass) \nShaded cabana with sofa seating, lounge chairs and a HDTV\nPrivate sand bar \nFire pit \nMini fridge stocked with bottled water\n\n\nAn 18% service fee will be charged for the total price of the cabana and on any food & beverage purchased. Wristbands must be worn on the pool deck.\n\n              \n                Huntington Cabana includes:\n                Located at the Huntington pool without the waterslides.\n\n\nDay Pass for up to 6 people (all amenities included in Day Pass) \nShaded cabana with sofa seating, lounge chairs, ceiling fan and a HDTV\nMini fridge stocked with bottled water\n\n\nAn 18% service fee will be charged for the total price of the cabana and on any food & beverage purchased. Wristbands must be worn on the pool deck.\n\n              \n                Beach Cabana includes:\n                Located on the beach across the street from the resort.\n\n\nAccommodates up to 2 people \nTwo deluxe lounge chairs and two towels \nValet parking is available at the hotel for $20 per vehicle and public parking is available at the beach (prices fluctuate)\n\n\nBeach Cabanas do not include pool access. For pool access, book a Day Pass with your Beach Cabana. \n Guests will check-in at Waterfront Adventures across the street from the resort. An 18% service fee will be charged at the hotel.\n\n              \n                Beach Bonfire includes:\n                Available anytime between 5pm-9pm. Located on the beach across the street from the resort.\n\n\nPrivate fire pit \nAdirondack chairs \nThree bundles of wood\nS'mores supplies for each person\nPersonal butler service to setup, start, and put out bonfire\nComplimentary sodas and waters\nValet parking is available for $20 per vehicle\n\n\nBeach Bonfire Experience does not include pool access. For pool access, book a Day Pass with your Beach Bonfire Experience. An 18% service fee will be charged at the hotel. No alcohol allowed on the beach.",
    "hours": "Hours\n              \nPool \n\n\n7:00am - 10:00pm\n\nWaterslide\n\n\nFri - Sun 11:00am - 3:00pm \nMon - Thurs 11:00am - 3:00pm \n\nFood & Beverage Service from Dock Bar & Boardwalk Restaurant \n\n\n11:00am - 6:00pm\n\nPoolside Cabana \n\n\n10:00am - 9:00pm\n\nBeach Cabana \n\n\n11:00am - 5:00pm\n\nBeach Bonfire \n\n\n5:00pm - 9:00pm",
    "address": "21100 Pacific Coast Hwy",
    "city": "Huntington Beach",
    "state": "CA",
    "icons": [
      "Cabana",
      "Hot Tub",
      "Beach Access",
      "Fitness Center",
      "Pool",
      "Spa",
      "Food Service",
      "Drink Service"
    ]
  },
  "Kimpton Shorebreak Resort": {
    "description": "Your surfer-stylish, beachfront base camp awaits. At the Kimpton Shorebreak Huntington Beach Resort, your inner escape artist and professional side will realign. At this boutique Huntington Beach hotel, your work day will be situated just steps from the hottest sand in Surf City, USA, as well as at the epicenter of the Main Street scene. Inside the property, a relaxed, coastal vibe is created through spirited interior design, an open-air patio with cozy firepits, elevated beach-chic dining at Pacific Hideaway restaurant and spacious, airy accommodations -- many offering views of the Huntington Beach Pier. Welcome to the most beloved resort in Huntington Beach -- paradise found.",
    "passes": "Work Pass includes:\n                Private guestroom from 7am - 5pm\n\n\nSpacious work area with writing desk and chair \nHighspeed wifi \nFlatscreen TV \nRecord player with bluetooth capability \nHotel amenities\nAll-day dining and room service available from Pacific Hideaway Restaurant \nComplimentary coffee, tea, hot chocolate and cider from 6am-10am \nComplimentary beer and wine happy hour at 5pm \nFitness center \nComplimentary beach chairs, towels, coolers and beach cruiser bikes \nVinyl library \nValet parking available for $20 per day \n\n\nAdditional resort fee of $20 plus tax will be charged at the property.\n\n              \n                Deluxe Work Pass includes:\n                Private suite from 7am - 5pm\n\n\nSeparated work room and bedroom with balcony \nSpacious work area with writing desk and chair \nHighspeed wifi \nFlatscreen TV \nRecord player with bluetooth capability \nHotel amenities\nAll-day dining and room service available from Pacific Hideaway Restaurant \nComplimentary coffee, tea, hot chocolate and cider from 6am-10am \nComplimentary beer and wine happy hour at 5pm \nFitness center \nComplimentary beach chairs, towels, coolers and beach cruiser bikes \nVinyl library \nValet parking available for $20 per day \n\n\nAdditional resort fee of $20 plus tax will be charged at the property.",
    "hours": "Hours\n              \nWork Pass \n\n\n7:00am - 5:00pm",
    "address": "500 Pacific Coast Highway",
    "city": "Huntington Beach",
    "state": "CA",
    "icons": [
      "Food Service",
      "Drink Service",
      "Beach Access",
      "Fitness Center"
    ]
  },
  "AC Hotel Irvine": {
    "description": "Modern style and California cool meet at AC Hotel Irvine, a contemporary resort in Park Place. With Disneyland, the Irvine Spectrum Center and the John Wayne Airport all nearby, AC Hotel Irvine is a centrally located option with an array of amenities. At the pool deck, you’ll be treated to an outdoor heated pool and spectacular views of the city. Kick back in a sunlounger or break a sweat in AC Hotel Irvine’s sleek fitness center. The choice is yours.",
    "passes": "Day Pass includes:\n                \nOutdoor heated pool\nFitness center\nComplimentary wifi\nComplimentary self-parking",
    "hours": "Hours\n              \nPool \n\n\n8:00am - 8:00pm",
    "address": "3309 Michelson Dr",
    "city": "Irvine",
    "state": "CA",
    "icons": [
      "Fitness Center",
      "Pool",
      "Drink Service"
    ]
  },
  "Hyatt Regency Newport Beach": {
    "description": "Splash, play, and relax at Newport Beach's best resort!  With three beautiful outdoor pool environments, there is something for everyone to enjoy. Adults can truly chill at the “Indulge” pool and find a secluded restful place at the “Serenity” pool. The “Oasis” pool offers fun amenities for both kids and adults alike.  Sip on refreshing drinks and enjoy delicious lunch served poolside or lounge in a shaded private cabana, perfect for those hotter days.  A day at the Hyatt Regency Newport Beach is the perfect daycation.",
    "passes": "Day Pass includes:\n                \nOasis Pool with waterslide, kid splash zone and games \nDaybeds in Oasis Pool and Serenity Pool \nPoolside food and beverage service \nPing pong, sand volleyball court and horseshoes \nComplimentary wifi \nComplimentary self-parking \n\n\nNo outside food and drink is allowed on the property.\n\n              \n                Golf Pass includes:\n                \nDay Pass (all amenities included in the Day Pass) \nA round of golf on 9-hole executive course \n10% discount on food and beverage purchases (excludes alcohol)\n\n\nNo outside food and drink is allowed on the property.\n\n              \n                Resort Package includes:\n                \nDay Pass (all amenities included in the Day Pass) \nA round of golf on 9-hole executive course\nComplimentary 2-hour beach cruiser bicycle rental \n10% discount on food and beverage purchases (excludes alcohol)\n\n\nNo outside food and drink is allowed on the property.\n\n              \n                Oasis Cabana includes:\n                \nDay Passes for up to 5 people \nShaded cabana at the family friendly Oasis Pool with waterslide \n2 lounge chairs, couch seating and side tables\nFlat-screen TV with DirectTV \n10% discount on food and beverage (does not include alcohol)\nComplimentary 4 bottles of water \n\n\nNo outside food and drink is allowed on the property. \n Children under 3 do not count towards max capacity.\n\n              \n                Indulge Cabana includes:\n                \nDay Passes for up to 5 people \nShaded cabana at the Indulge Pool\n2 lounge chairs, couch seating, side tables and an ice chest\nFlat-screen TV with DirectTV \n10% discount on food and beverage (does not include alcohol)\nComplimentary 4 bottles of water \n\n\nNo outside food and drink is allowed on the property. \n Children under 3 do not count towards max capacity.",
    "hours": "Hours\n              \nPool \n\n\n8:00am - 7:30pm\n\nCabana \n\n\n8:00am - 7:30pm\n\nWaterslide (upon request) \n\n\n10:00am - 4:00pm\n\nShor To Go Food & Drink Service \n\n\nAvailable anytime via texting service",
    "address": "1107 Jamboree Road  Newport Beach",
    "city": "California",
    "state": "92660",
    "icons": [
      "Drink Service",
      "Food Service",
      "Cabana",
      "Pool",
      "Fitness Center"
    ]
  }
}
